notes-md/20250114133247-python_strings.md

# Table of Contents

1.  [Do not forget to add the corresponding explanation of string[i] in Chess Dictionary Validator](#org7405df7)
2.  [Strings](#orgd5493f5)
    1.  [Tools](#org2998643)
        1.  [len function](#orgd0bfbd2)
        2.  [Acces characters of a string](#orgdfdb263)
    2.  [Methods](#org9b6a47e)
        1.  [upper(), lower(), title()](#org96f5b1e)
        2.  [isupper(), islower(), istitle(), isdecimal(), isalpha()](#orgb12f0a9)
        3.  [join()](#org2c44fe3)
3.  [See Also](#org2f0eef9)



<a id="org7405df7"></a>

# Do not forget to add the corresponding explanation of string[i] in [Chess Dictionary Validator](20250114120918-chess_dictionary_validator.md)


<a id="orgd5493f5"></a>

# Strings

A string in python can be thought as a non mutable list of characters, so we can use some of the functions and tools that we applied to lists.


<a id="org2998643"></a>

## Tools


<a id="orgd0bfbd2"></a>

### len function

With the `len(str)` function we can get the lenght of the string.

1.  Use Cases

    1.  Check for password lenght
    
            password = input("Write a password: ")
            if len(password) < 14:
                print("Sorry, but password must be at least 14 characters long")
            else:
                print("Password is ok")


<a id="orgdfdb263"></a>

### Acces characters of a string

To acces a character of a string we use the index syntax or we can slice it, like a list.
`Remember that strings are non mutable so we can't change one character of the string, we can only check what is the character in an x position of the string`

1.  Use Cases

    1.  Check for domain of a url
    
        This program just check if an url is a .com domain url
        
            urls = ["google.com", "Hola, Jaime", "ejemplo.com", "Maria"]
            for url in urls:
                domain = url[-4:]
                if domain == ".com":
                    print("It is a .com url")
                else:
                    print("It is not a .com url")


<a id="org9b6a47e"></a>

## Methods


<a id="org96f5b1e"></a>

### upper(), lower(), title()

This methods return a copy of the string, but with all its characters in uppercase, lowercase or title, depending of the method.

1.  Use Cases

    1.  Standarized strings to compare
    
        Both of these progrmas will receive a string and apply the upper or lower method to compere it to other string.
        They will ask for a password, but be aware that this is not the right way to manage password entry, this is just an example of a situation when we just care for the word and not the case.
        
            password = input("Enter the secret word")
            if password.upper() == "SECRET":
                print("You enter")
            else:
                print("Wrong word")
        
            password = input("Enter the secret word")
            if password.lower() == "secret":
                print("You enter")
            else:
                print("Wrong word")


<a id="orgb12f0a9"></a>

### isupper(), islower(), istitle(), isdecimal(), isalpha()

All this method check if the string is the thing that they are calling, and return `True` or `False`

-   **isupper:** Check if the string is uppercase
-   **islower:** Check if the string is lowecase
-   **istitle:** Check if the string is a title (Every beginning letter of every word is in uppercase and the rest is in lowercase, example: "This Is A Title")
-   **isdecimal:** Check if the string is a number
-   **isalpha:** Check if the string is formed of just letters


<a id="org2c44fe3"></a>

### TODO join()

Join just work with a list of string iterables see [Practice Project - Date Detection](20250124171147-practice_project_date_detection.md)


<a id="org2f0eef9"></a>

# See Also

-   [Python List](20250111131854-python_list.md)

